app/views/posts/show.html.erb

					<div class="meta">
						<div class="user">by <%= User.find(@post.user_id).email %></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]