app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
	def index
		@post = Post.new
		@posts = Post.order("created_at desc").paginate(:per_page => 2, :page => params[:page])

INSERT INTO "posts" ("category", "content", "created_at", "isApproved", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		authorize
		@post = Post.new(params[:post])

		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "likescount" = 1, "updated_at" = '2013-02-24 20:01:21.759417' WHERE "posts"."id" = 4
---
	def like
		@current_user = current_user
		@post = Post.find(params[:id])
		if @current_user.flagged?(@post, :like)
			@current_user.unflag(@post, :like)
			@post.decrement(:likescount)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
	def myposts
		authorize
		@posts = current_user.posts.order("created_at desc").paginate(:per_page => 2, :page => params[:page])