app/controllers/users_controller.rb

	def create
  		@user = User.new(params[:user])
  		if @user.save
---
INSERT INTO "users" ("created_at", "dateReported", "email", "facebook", "g_plus", "isBanned", "isReported", "name", "occupation", "password_hash", "password_salt", "twitter", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)